Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: ཀུན་ཏུ་བཟང་པོ་ཁྱོད་ནི་མ་འོངས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པ་གང་གཱའི་ཀླུང་གཅིག་གི་བྱེ་མ་སྙེད་འདས་ནས། བསྐལ་པ་གྲངས་མེད་པ་གཉིས་པ་ལ་བབ་པ་ན་བྱང་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་དྲུག་ཅུའི་བྱེ་མ་སྙེད་འདས་པ་དེ་ན་འཇིག་རྟེན་གྱི་ཁམས་ཡེ་ཤེས་ཀྱི་ཆུ་ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཡོན་ཏན་ཞེས་བྱ་བ་ཞིག་འབྱུང་སྟེ།
en: Samantabhadra, in the future, when countless eons, as numerous as the grains of sand in the Ganges River, have passed, and a second series of countless eons has begun, in the northern direction from here, beyond as many buddha realms as there are grains of sand in sixty Ganges Rivers, there will be a world realm called Jñāna­tāpasuviśuddha­guṇā.

source: ཀུན་ཏུ་བཟང་པོ་ཁྱོད་ནི་དེར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: You, Samantabhadra, will attain the complete enlightenment of perfect enlightenment there.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡེ་ཤེས་རྡོ་རྗེ་རྣམ་པར་བསྒྱིངས་པའི་དབང་ཕྱུག་ཏོག་ཅེས་བྱ་བ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་དུ་འགྱུར་རོ།
en: You will become the tathāgata arhat samyaksam­buddha, and so on, up to and including the buddha bhagavat, named Jñāna­vajra­vijṛmbhiteśvara­ketu.’ “

source: །རིགས་ཀྱི་བུ་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་ཏུ་བཟང་པོས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་ཞབས་ལ་ཡན་ལག་ལྔས་མགོ་བོས་གཏུགས་པ་དང་།
en: Then, noble son, the bodhisattva Samantabhadra bowed down his head to the feet of the Tathāgata Ratnagarbha. “

source: དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་བཀའ་སྩལ་པ། བརྟུལ་ཞུགས་བཟང་པོ་རབ་ཏུ་དགའ་བ་སེམས་དུལ་ལོངས།
en: The Tathāgata Ratnagarbha said: “ ‘Arise, you who have perfect joy, excellent resolve, and a controlled mind!

source: །དམ་བཅས་བརྟན་པ་སེམས་ཅན་རྣམས་ཀྱི་རྒྱུད་སྦྱོངས་ལ། །ཁྱོད་ཀྱིས་སེམས་ཅན་ཉོན་མོངས་མི་བཟད་ཀླུང་ལས་སྒྲོལ།
en: You who have an unwavering commitment, you must purify the mind continuum of beings And liberate beings from the terrible river of the kleśas.

source: །ཁྱོད་ནི་འཇིག་རྟེན་ཡེ་ཤེས་སྒྲོན་མཆོག་སངས་རྒྱས་འགྱུར།
en: You will become a buddha, a lamp of wisdom in the world.’ “

source: །རིགས་ཀྱི་བུ་ཡང་དེའི་ཚེ་ན་སྲོག་ཆགས་ལེ་ལོ་ཅན་ཁྲིས་ཚིག་འཐུན་པར་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་བསམ་པ་ཤིན་ཏུ་རྣམ་པར་དག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་ཏུ་བཟང་པོས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་ཅིང་ཡོངས་སུ་དག་པར་འཇོག་པར་འགྱུར་བ་ན་བདག་ཅག་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དེར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་འགྱུར་བར་བགྱིའོ།
en: Then, noble son, ten thousand lazy beings said in one voice, ‘Bhadanta Bhagavat, we shall become tathāgata arhat samyaksam­buddhas in the pure buddha realms which, with completely pure motivation, the bodhisattva mahāsattva Samantabhadra, while performing the conduct of a bodhisattva, will purify.

source: །དེ་ལྟར་བདག་ཅག་གིས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་བགྱིས་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྐྱེ་བར་གྱུར་ཅིག །
en: May we thus complete the six perfections and be reborn in a buddha realm there.’ “

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་སྲོག་ཆགས་ཁྲི་པོ་དེ་དག་ལ་འདི་སྐད་ཅེས་ལུང་བསྟན་ཏེ། གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་དེའི་ཚེ། ཁྱོད་ཅག་འཇིག་རྟེན་གྱི་ཁམས་དེའི་ཁོ་ར་ཁོར་ཡུག་དག་ཏུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ། སྟོང་སྟོང་ཞིང་མཚན་འཐུན་པའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ།
en: Noble son, the Tathāgata Ratnagarbha thus predicted of those ten thousand beings, ‘When the bodhisattva Samantabhadra attains the complete enlightenment of perfect buddhahood, you will attain the complete enlightenment of perfect buddhahood in the surrounding realms.

source: །འདི་ལྟ་སྟེ་སྟོང་ནི་དེ་བཞིན་གཤེགས་པ་མེ་ལྕེ་ཐབ་ཁུང་དབང་ཕྱུག་དབྱངས་ཞེས་བྱ་བར་འགྱུར་རོ།
en: You will become tathāgatas in groups of thousands that have the same names: “ ‘One thousand will be tathāgatas called Jvālakuṇḍeśvaraghoṣa. “ ‘

source: །གཞན་ཡང་སྟོང་ནི་དེ་བཞིན་གཤེགས་པ་སྡོམ་པའི་དབང་ཕྱུག་དབྱངས་ཞེས་བྱ་བར་འགྱུར་རོ།
en: Another thousand will be called Saṃvṛtīśvaraghoṣa. “ ‘

source: །གཞན་ཡང་སྟོང་ནི་དེ་བཞིན་གཤེགས་པ་ཤིན་ཏུ་དྲི་མེད་དབྱངས་ཀྱི་དབང་ཕྱུག་རྒྱལ་པོ་ཞེས་བྱ་བར་འགྱུར་རོ།
en: Another thousand will be called Suvimalaghoṣeśvararāja. “ ‘

source: །གཞན་ཡང་སྟོང་ནི་དེ་བཞིན་གཤེགས་པ་གྱ་ནོམ་འཇིགས་མེད་དབྱངས་ཀྱི་དབང་ཕྱུག་རྒྱལ་པོ་ཞེས་བྱ་བར་འགྱུར་རོ།
en: Another thousand will be called Prahīṇabhayaghoṣeśvararāja. “ ‘

source: །གཞན་ཡང་སྟོང་ནི་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་དབྱངས་ཀྱི་གཟི་བརྗིད་དབང་ཕྱུག་རྒྱལ་པོ་ཞེས་བྱ་བར་འགྱུར་རོ།
en: Another thousand will be called Vimalaghoṣatejeśvararāja. “ ‘

source: །ལྔ་བརྒྱ་ཡང་མཚན་འཐུན་ཏེ། འདི་ལྟ་སྟེ་ཉི་མའི་དབྱངས་ཞེས་བྱ་བར་འགྱུར་རོ། །དེ་བཞིན་དུ་ཉིས་སྟོང་ལྔ་བརྒྱ་ནི་འཇིགས་བྲལ་གྲགས་པའི་རྒྱལ་པོ་དང་། འོད་ཟེར་བྲལ་དང་། འོད་ཟེར་བྲལ་བའི་དབྱངས་དང་། གྲགས་པའི་དབང་ཕྱུག་དབྱངས་དང་།
en: Five hundred others will all have the same name; they will be called Sūryaghoṣa.” “ ‘

source: རྣམ་གྲོལ་ཆོས་གྲགས་དབྱངས་དང་། སྙིང་པོ་གྲགས་པའི་རྒྱལ་པོ་དང་། རིན་ཆེན་རྒྱལ་མཚན་དང་། སྣང་བའི་དབང་ཕྱུག་དང་། ཐུབ་ཆེན་ཡེ་ཤེས་འབར་བའི་དབང་ཕྱུག་དང་། གནས་ཀྱི་གོས་བསྩགས་རྒྱལ་པོ་དང་། ཡེ་ཤེས་བློ་གྲོས་བསམ་ཡས་སྙིང་པོ་དང་། ཡེ་ཤེས་ལྷུན་པོའི་རྒྱལ་མཚན་དང་། ཡེ་ཤེས་རྒྱ་མཚོའི་རྒྱལ་པོ་དང་། བརྩོན་འགྲུས་ཆེན་པོའི་དབྱངས་ཀྱི་དབང་ཕྱུག་དང་། ལྷུན་པོའི་དཔལ་ལྟ་བུ་དང་། ཡེ་ཤེས་རྡུལ་བྲལ་ཤུགས་དང་། ཅིའི་དབང་ཕྱུག་ས་བོན་དང་། ཡེ་ཤེས་ཤིན་ཏུ་དྲི་མེད་སྒྲོགས་པའི་དབང་ཕྱུག་དང་། ཡོན་ཏན་རྒྱ་མཚོའི་ཟིལ་མནན་རྒྱལ་པོ་དང་། ཡེ་ཤེས་འབྱུང་བ་སྟོབས་ཀྱི་རྒྱལ་པོ་དང་། བྱང་ཆུབ་རྡུལ་བྲལ་རྒྱལ་པོ་དང་། ཐུབ་པ་དཔལ་བརྩེགས་ཤུགས་ཀྱི་མེ་ཏོག་དང་། ཡེ་ཤེས་དཔལ་བརྩེགས་བློ་དང་། རྡོ་རྗེ་སེང་གེ་དང་། ཚུལ་ཁྲིམས་འོད་གསལ་དང་། བཟང་མཆོག་དང་། འོད་ཟེར་མཐའ་ཡས་དང་། སེང་གེ་དགའ་དང་། ཡེ་ཤེས་མི་ཟད་བརྩེགས་དང་། རིན་ཆེན་སྣང་བ་དང་། ཡེ་ཤེས་དྲི་མེད་དང་། ཡེ་ཤེས་རྒྱས་པ་དང་། སེང་གེ་གྲགས་པ་དང་། མངོན་ཤེས་ཡོན་ཏན་རྒྱལ་པོ་དང་། ཆོས་ཀྱི་སྣ་མའི་མེ་ཏོག་ཆར་འབེབས་དང་། འོད་བྱེད་དང་། ལྷུན་པོ་མངོན་འཕགས་དང་། ཆོས་ཡང་དག་འཕགས་རྒྱལ་པོ་དྲི་མེད་དང་། སྤོས་ཀྱི་དབང་ཕྱུག་དང་། དྲི་མེད་སྤྱན་དང་། རབ་ཏུ་ཆེ་བསྩགས་དང་། ཐོགས་མེད་སྟོབས་སྤོས་ཀྱི་རྒྱལ་པོ་དང་། རང་གི་ཡེ་ཤེས་
en: Another 2,500 will have these names: Vigatabhayakīrtirāja, Vigataraśmi, Vigataraśmighoṣa, Kīrtīśvaraghoṣa, Vipara­dharmakīrti­ghoṣa, Garbha­kīrti­rāja, Ratna­dhvaja, Jyotīśvara, Uttapta­muni­jñāneśvara, Ketacīvara­saṃbhṛta­rāja, Acintyamati­jñāna­garbha, Jñānamerudhvaja, Jñānasāgara­rāja, Mahāvīryaghoṣeśvara, Meruśrīkalpa, Jñāna­virajavega, Kimīśvarabīja, Jñāna­suvimalagarjiteśvara, Abhi­bhūta­guṇa­sāgara­rāja, Jñāna­saṃbhavabala­rāja, Viraja­vīreśvara­rāja, Muni­śrīkūṭavega­saṃkusuma, Śrīkūṭa­jñāna­buddhi, Vajrasiṃha, Śīla­prabhāsvara, Bhadrottama, Anantaraśmi, Siṃhanandi, Akṣayajñānakūṭa, Ratnāvabhāsa, Jñānavimala, Jñānapravāḍa, Siṃhakīrti, Abhijñāguṇarāja, Dharmasumanāvarṣin, Prabhākara, Abhyudgatameru, Dharma­samudgata­rāja­vimala, Gandheśvara, Vimalanetra, Mahāprasandaya, Asaṅgabalarāja, Svajñānapuṇyabala, Jñānacīvara, Vaśavartin, Asaṅgahiteṣin, Jñānasaṃbhava, Mahāmeru, Balagarbha, Guṇākara, Latākusumadhvaja, Guṇaprabhāsa, Viguṇamoharāja, Vajrottama, Dharmaketu, Ghoṣendrarāja, Svagupta, Vajradhvaja, Ratneśvara, Abhyudgatadhvaja, Śailakalpa, Ratimegha, Dharma­kārisāla­rāja, Samantaguptasāgara­rāja, Jñānasaṃnicaya, Jñānārci, Kusumagaṇi, Gajendreśvara, Udumbarapuṣpa, Kāñcanadhvaja, Dharmadhvaja, Vinarditarāja, Candana, Supra­tiṣṭhitasthāma­vikrama, Dhvajāgrapradīpa, Jñānakrama, Sāgaradhvaja, Vyayadharmakīrti, Māravinardita, Guṇārci, Jñānaprabha, Jñānapradīpa, Kṣemarāja, Jñānaghoṣa, Dhvajasaṃgraha, Vajrapradīpa, Vyūharāja, Jayasaṃkhya, Supratiṣṭhita, Maticandrarāja, Kramavinardita­rāja, Sālendrasiṃha­vigraha, Nārāyaṇavijitagarbha, Ratna­guṇa­saṃnicaya, Jyotigarbha, Nakṣatra­vibhavakīrti, Puṇyabala­sāla­rāja, Manojñaghoṣa, Brahmottara, and Dhṛtarāṣṭra. “ ‘

source: བསོད་ནམས་སྟོབས་དང་། ཡེ་ཤེས་ཆོས་གོས་དང་། དབང་སྒྱུར་དང་། ཆགས་མེད་ཕན་བཞེད་དང་། ཡེ་ཤེས་ཡང་དག་འབྱུང་དང་། ལྷུན་པོ་ཆེན་པོ་དང་། སྟོབས་ཀྱི་སྙིང་པོ་དང་། ཡོན་ཏན་འབྱུང་གནས་དང་། འཁྲི་ཤིང་མེ་ཏོག་རྒྱལ་མཚན་དང་། ཡོན་ཏན་འོད་དང་། གཏི་མུག་རྣམ་བྲལ་ཡོན་ཏན་རྒྱལ་པོ་དང་། རྡོ་རྗེ་མཆོག་དང་། ཆོས་ཀྱི་ཏོག་དང་། དབྱངས་ཀྱི་དབང་པོའི་རྒྱལ་པོ་དང་། ལེགས་སྦས་དང་། རྡོ་རྗེ་རྒྱལ་མཚན་དང་། རིན་ཆེན་དབང་ཕྱུག་དང་། མངོན་འཕགས་རྒྱལ་མཚན་དང་། རི་བོ་ལྟ་བུ་དང་། དགའ་སྤྲིན་དང་། ཆོས་བྱེད་དང་། སཱ་ལའི་རྒྱལ་པོ་དང་། ཀུན་སྦེད་དང་། རྒྱ་མཚོའི་རྒྱལ་པོ་དང་། ཡེ་ཤེས་ཡང་དག་བསྩགས་དང་། ཡེ་ཤེས་འོད་འཕྲོ་དང་། མེ་ཏོག་ཚོགས་ཅན་དང་། གླང་པོ་ཆེའི་དབང་པོའི་དབང་ཕྱུག་དང་། ཨུ་དུམ་བཱ་རའི་མེ་ཏོག་དང་། གསེར་གྱི་རྒྱལ་མཚན་དང་། ཆོས་ཀྱི་རྒྱལ་མཚན་དང་། སྒྲོགས་པའི་རྒྱལ་པོ་དང་། ཙན་དན་དང་། ཤིན་ཏུ་བརྟན་པ་དང་། མཐུས་གནོན་དང་། རྒྱལ་མཚན་གྱི་རྩེ་མོའི་སྒྲོན་མ་དང་། ཡེ་ཤེས་གོ་རིམས་དང་། རྒྱ་མཚོའི་རྒྱལ་མཚན་དང་། རྣམ་རྒྱལ་ཆོས་གྲགས་དང་། ང་རྒྱལ་སྒྲོགས་དང་། ཡོན་ཏན་འོད་འཕྲོ་དང་། ཡེ་ཤེས་འོད་དང་། ཡེ་ཤེས་སྒྲོན་མ་དང་། བདེ་བའི་རྒྱལ་པོ་དང་། ཡེ་ཤེས་དབྱངས་དང་། རྒྱལ་མཚན་བསྡུས་པ་དང་། རྡོ་རྗེའི་སྒྲོན་མ་དང་། བཀོད་པའི་རྒྱལ་པོ་དང་། རྒྱལ་བའི་གྲངས་དང་། རབ་ཏུ་བརྟན་པ་དང་། བློ་གྲོས་ཟླ་བའི་རྒྱལ་པོ་དང་། རིམ་གྱིས་སྒྲོགས་པའི་རྒྱལ་པོ་དང་། སཱ་ལའི་དབང་པོ་སེང་གེའི་སྒྲ་དང་། སྲེད་མེད་ཀྱི་བུས་རྣམ་པར་རྒྱལ་བའི་སྙིང་པོ་དང་། ཡོན་ཏན་རིན་ཆེན་ཡང་དག་བསྩགས་དང་། སྐར་མའི་སྙིང་པོ་དང་། སྐར་མ་རྣམ་འཇིག་གྲགས་པ་དང་། བསོད་ནམས་སྟོབས་སཱ་ལའི་རྒྱལ་པོ་དང་། ཡིད་དུ་འོང་བའི་དབྱངས་དང་། ཚངས་མཆོག་དང་། ཡུལ་འཁོར་སྲུང་ཞེས་བྱ་བར་འགྱུར་རོ། །གཞན་ཡང་སྟོང་ནི་སྤོས་ཀྱི་པད་མ་རྣམ་རྒྱལ་གྲགས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་། འོད་ཟེར་གྱི་དཀྱིལ་འཁོར་སྣང་བ་དང་། སྣང་བའི་རྒྱལ་པོ་དང་། སྤོས་ཀྱི་པད་མ་དམ་པའི་ཤུགས་དང་། ཡོན་ཏན་རྒྱ་མཚོའི་མཐའ་ཡས་ཡེ་ཤེས་བླ་མ་དང་། འཛམ་བུའི་གྲིབ་མ་དང་། ཡོན་ཏན་རི་བོའི་རྒྱལ་མཚན་དང་།
en: Another thousand will be named Gandha­padma­vijitakīrti­rāja, Raśmimaṇḍala­jyotiprabhāsa­rāja, Gandha­padmottaravega, Ananta­guṇa­sāgarajñānottara, Jambūcchāya, Guṇaśailadhvaja, Siṃhaketu, Nāga­vivarjitakusumateja­rāja, Sugandhabījanairātma, and Amṛtaguṇatejarāja. “ ‘

source: སེང་གེའི་ཏོག་དང་། ཀླུས་སྤངས་མེ་ཏོག་གཟི་བརྗིད་རྒྱལ་པོ་དང་། དྲི་ཞིམ་ས་བོན་བདག་མེད་དང་། ཡོན་ཏན་བདུད་རྩི་གཟི་བརྗིད་རྒྱལ་པོ་ཞེས་བྱ་བ་དག་ཏུ་འགྱུར་རོ། །གཞན་ཡང་སྟོང་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་སྦྱིན་རྒྱལ་པོ་ཀླུ་དབང་རྣམ་གྲོལ་སད་བྱེད་འཇིག་རྟེན་རྒྱ་མཚོའི་མིག་གི་རི་བོ་ཞེས་བྱ་བ་ཤ་སྟག་ཏུ་འགྱུར་ཏེ།
en: Another thousand will be tathāgata arhat samyaksam­buddhas called Visṛṣṭa­dharma­rāja and Nāgendravi­mukti­buddha­loka­sāgaralocanaśaila. “ ‘

source: འཇིག་རྟེན་གྱི་ཁམས་གཞན་དང་། གཞན་དག་ཏུ་ཉི་མ་གཅིག་དང་། དུས་གཅིག་ཏུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཞིང་།
en: At the same time, on the same day, they will attain the complete enlightenment of perfect buddhahood in the different world realms.

source: དེ་དག་གི་ཚེའི་ཚད་ནི་བར་གྱི་བསྐལ་པ་བཅུར་འགྱུར་རོ།
en: Their lifespans will be ten intermediate eons.’ “

source: །སྲོག་ཆགས་ཁྲི་པོ་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་ཞབས་ལ་ཡན་ལག་ལྔས་མགོས་གཏུགས་པ་དང་།
en: Those ten thousand beings bowed down to the feet of the Tathāgata Ratnagarbha.

source: དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་བཀའ་སྩལ་པ། ཀླུ་ལྟར་བརྟན་པར་སྒྲོགས་པ་དག་ནི་རེ་ཤིག་ལོངས།
en: The Tathāgata Ratnagarbha said: “ ‘Arise, you who have the unwavering bellowing of elephants.

source: །དགེ་བའི་ནོར་རྣམས་དག་ནི་ཡང་དག་སྩོགས་གྱིས་ལ།
en: You who have accumulated the riches of virtue.

source: །ཕ་རོལ་ཕྱིན་པ་རྣམས་ལ་མྱུར་དུ་བརྩོན་གྱིས་དང་། །ལྷ་མི་འཇིག་རྟེན་རྣམས་ཀྱི་འདྲེན་པ་དག་ཏུ་འགྱུར།། །།
en: Having become engaged in the perfections with urgency, You will become leaders for the worlds of gods and men.’ “

source: བམ་པོ་བདུན་པ། རིགས་ཀྱི་བུ་དེ་ནས་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་རྒྱལ་བུ་དགུ་པ་སྡིག་མེད་ཅེས་བྱ་བ་ལ་སྨྲས་པ་དང་། སྔ་མ་བཞིན་དུ་སྦྱར་ཏེ།
en: Then, noble son, the brahmin Samudrareṇu spoke to the ninth prince, who was named Anagha, and it proceeded as before.

source: དེས་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་ཅི་ནས་ཀྱང་བདག་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་པ་རྣམས་བདག་གི་དཔང་ལགས་པར་འགྱུར་བ་དེ་ལྟར་བདག་གིས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པར་བགྱི་སྟེ།
en: The prince said, ‘Bhadanta Bhagavat, I shall perform bodhisattva conduct in such a way that bhagavat buddhas as numerous as the grains of sand in the Ganges River, who reside, live, and remain in realms in the ten directions as numerous as the grains of sand in the Ganges River, will be the witnesses for my performance of bodhisattva conduct. “ ‘

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གང་བདག་གིས་ཁྱོད་ཀྱི་སྤྱན་སྔར་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་དེའི་བར་དུ་བདག་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་འགྱོད་པའི་སེམས་སྐྱེ་བར་མ་གྱུར་ཅིག །
en: Bhadanta Bhagavat, from the time I develop the aspiration for enlightenment in your presence until I attain the complete enlightenment of perfect buddhahood, may I never regret performing bodhisattva conduct.

source: བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་པ་ཉེ་བར་བཟུང་བའི་བར་དུ་དམ་བཅས་པ་བརྟན་ཞིང་ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་དུ་བགྱིད་པར་གྱུར་ཅིག །
en: Until I reach enlightenment may my commitment be firm, and may I carry out whatever I say I will.

source: སེམས་ཅན་གཞན་གྱི་སེམས་འཁྲུག་པར་མི་བགྱིད་པར་གྱུར་ཅིག །
en: May I never disturb the minds of other beings.

source: བདག་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པར་སེམས་མི་བསྐྱེད་པར་གྱུར་ཅིག །
en: May the motivation for the path of śrāvakas and pratyekabuddhas never arise to me.

source: འདོད་པའི་འདོད་ཆགས་ཀྱི་སེམས་དང་། སེམས་ལས་བྱུང་བ་སྐྱེ་བར་མ་གྱུར་ཅིག །
en: May a mind or mental event of desiring sense pleasures never arise.

source: རྨུགས་པ་དང་གཉིད་དང་ལྡན་པར་མ་གྱུར་ཅིག །
en: May dullness and sleepiness never arise.

source: རྒོད་པ་དང་ལྡན་པར་མ་གྱུར་ཅིག །
en: May restlessness never arise.

source: འགྱོད་པ་དང་ལྡན་པར་མ་གྱུར་ཅིག །
en: May remorse never arise.

source: ཐེ་ཙོམ་དང་ལྡན་པར་མ་གྱུར་ཅིག །བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་གི་བར་དུ་བདག་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན།
en: May doubt never arise.

source: སྲོག་གཅོད་པ་མ་མཆིས་པ་དང་། མ་བྱིན་པར་ལེན་པ་མ་མཆིས་པ་དང་། མི་ཚངས་པར་སྤྱོད་པ་མ་མཆིས་པ་དང་། བརྫུན་དུ་སྨྲ་བ་མ་མཆིས་པ་དང་། ཕྲ་མ་མ་མཆིས་པ་དང་། ངག་རྩུབ་པོ་མ་མཆིས་པ་དང་། ཚིག་ཀྱལ་པ་མ་མཆིས་པ་དང་། བརྣབ་སེམས་མ་མཆིས་པ་དང་། གནོད་སེམས་མ་མཆིས་པ་དང་། ལོག་པར་ལྟ་བ་མ་མཆིས་པ་དང་། ཐེ་ཙོམ་དང་ལྡན་པ་མ་མཆིས་པ་དང་།
en: May I never take life, take what has not been given, fail to maintain celibacy, lie, slander, speak harshly, speak meaninglessly, be avaricious, be malicious, hold wrong views, be miserly, or be disrespectful to or contradict the Dharma.

source: ཆོས་ལ་མི་གུས་པའི་སེམས་མ་མཆིས་པ་དང་།
en: Until I reach enlightenment, as I perform bodhisattva conduct, may I never have those qualities.

source: སླུ་བའི་སེམས་མ་མཆིས་ཤིང་ཆོས་དེ་དག་མ་མཆིས་པར་གྱུར་ཅིག །བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་པ་ཉེ་བར་བཟུང་བའི་བར་དུ་གོམ་པ་འདོར་བ་ཙམ་ལ་ཡང་རྟག་ཏུ་སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་སེམས་དང་སེམས་ལས་བྱུང་བ་དག་འཇུག་པར་གྱུར་ཅིག །
en: Until I reach enlightenment, even when I am just taking a step, may my mind and mental events always be engaged in remembering the Buddha.

source: བདག་བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་གི་བར་དུ་སངས་རྒྱས་མཐོང་བ་དང་། ཆོས་ཉན་པ་དང་། དགེ་འདུན་ལ་བསྙེན་བཀུར་བགྱིད་པ་དང་མི་འབྲལ་བར་གྱུར་ཅིག །
en: Until I reach enlightenment, may I never be bereft of seeing the Buddha, hearing the Dharma, and serving the Saṅgha.

source: ཚེ་རབས་ཐམས་ཅད་དུ་ཡང་རབ་ཏུ་འབྱུང་བ་ཐོབ་པར་གྱུར་ཅིག །ཚེ་རབས་ཐམས་ཅད་དུ་ཕྱག་དར་ཁྲོད་པར་གྱུར་ཅིག །ཆོས་གོས་གསུམ་པ་དང་། ཤིང་དྲུང་པ་དང་། ཅོག་བུ་པ་དང་། དགོན་པ་པ་དང་།
en: May I become ordained in all my lifetimes.

source: བསོད་སྙོམས་པ་དང་། འདོད་པ་ཆུང་བ་དང་། ཆོག་ཤེས་པ་དང་། ཆོས་སྟོན་པ་དང་། ཚིག་བཙུན་པ་དང་སྤོབས་པ་དཔག་ཏུ་མ་མཆིས་པ་ཕུན་སུམ་ཚོགས་པར་གྱུར་ཅིག །
en: May I in all my lifetimes wear sewn-together rags, wear the three Dharma robes, dwell at the foot of a tree, sleep sitting upright, live in the wilderness, beg for alms, have few desires, be content, teach the Dharma, speak appropriately, and be endowed with limitless eloquence.

source: ལྟུང་བའི་རྩ་བ་འབྱུང་བར་མ་གྱུར་ཅིག །
en: May I never commit a root downfall.

source: བརྫུན་དུ་སྨྲ་བ་དང་ལྡན་པའི་ཚིག་རྣམས་ཀྱིས་ཕས་ཀྱི་རྒོལ་བ་འདུལ་བར་མ་གྱུར་ཅིག །
en: May I never subjugate opponents with words that are lies.

source: བུད་མེད་ལ་སྟོང་པ་ཉིད་དང་ལྡན་པའི་ཆོས་སྟོན་པར་མ་གྱུར་ཅིག །
en: May I never give a Dharma teaching concerning emptiness to a female.

source: སྟོང་པ་ཉིད་ཡིད་ལ་བགྱིད་པས་བུད་མེད་ལ་ཆོས་སྟོན་པར་བགྱིད་པར་མ་གྱུར་ཅིག །
en: May I never teach the Dharma to a female with my mind focused on emptiness.

source: ལག་པ་སྒྱུར་ཞིང་ཆོས་སྟོན་པར་མ་གྱུར་ཅིག །
en: May I never teach the Dharma gesturing with my hands.

source: རྟག་ཏུ་བདག་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་སྟོན་པའི་འདུ་ཤེས་སྐྱེད་པར་གྱུར་ཅིག །
en: May I always perceive bodhisattvas who have set out on the Mahāyāna as my teachers.

source: བདག་ཆོས་སྨྲ་བ་གང་ལ་ཆོས་ཉན་པ་ན་དེ་ལ་སྟོན་པའི་འདུ་ཤེས་ཀྱིས་བསྙེན་བཀུར་བགྱིད་པར་གྱུར་ཅིག །བདག་ཆོས་སྨྲ་བ་དེ་ལ་དེ་བཞིན་གཤེགས་པ་ལ་ཇི་ལྟ་བ་དེ་ལྟར་རིམ་གྲོ་བགྱིད་པ་དང་། བསྙེན་བཀུར་བགྱིད་པ་དང་། བླ་མར་བགྱིད་པ་དང་། རི་མོར་བགྱིད་པ་དང་།
en: Whenever I listen to the Dharma from a Dharma reciter, may I perceive him to be my teacher and, having honored him, may I serve, honor, respect, and make offerings to that Dharma reciter as I would a tathāgata, to the extent that I would serve that Dharma reciter even with my own flesh.

source: མཆོད་པར་བགྱིད་པར་གྱུར་ཅིག །
en: May I give to others without a thought of whether they are a worthy or unworthy recipient.

source: ཆོས་སྨྲ་བ་ལ་བདག་གི་ཤ་དག་གི་བར་གྱིས་ཀྱང་བསྙེན་བཀུར་བགྱིད་པར་གྱུར་ཅིག །བདག་སྣོད་དང་སྣོད་མ་ལགས་པར་མི་རྟོག་པར་སྦྱིན་པ་སྦྱིན་པར་གྱུར་ཅིག །བདག་ཆོས་ཀྱི་སྦྱིན་པ་ལ་སེར་སྣའི་སེམས་དང་སེམས་ལས་བྱུང་བ་དག་སྐྱེད་པར་མ་གྱུར་ཅིག །
en: May I never have a mind or mental event of miserliness when making the gift of the Dharma.

source: བདག་བྱང་ཆུབ་དོན་དུ་གཉེར་བའི་སེམས་ཅན་རྣམས་ལ་རང་གི་སྲོག་གི་སྦྱིན་པས་ཡོངས་སུ་སྐྱོབ་པར་གྱུར་ཅིག །
en: May I protect those beings who are dedicated to enlightenment by giving my life.

source: བདག་ཉིད་ཀྱི་བརྩོན་འགྲུས་ཀྱི་སྟོབས་དང་། སྨོན་ལམ་གྱིས་ཉེ་བར་བསྒྲུབས་པའི་རྫས་ཀྱིས་སེམས་ཅན་སྡུག་བསྔལ་བར་གྱུར་པ་རྣམས་སྡུག་བསྔལ་དག་ལས་ཡོངས་སུ་ཐར་བར་བགྱིད་པར་གྱུར་ཅིག །
en: May I free beings in distress from their distress with whatever wealth I have gained through my diligence, my strength, and my prayers.

source: བདག་རབ་ཏུ་བྱུང་བའི་རྟགས་ཅན་ནམ། ཁྱིམ་པའི་རྟགས་ཅན་ལྟུང་བ་བྱུང་བའམ། ལྟུང་བ་མ་བྱུང་བ་དག་ལ་སྐུར་བར་བགྱིད་པར་མ་གྱུར་ཅིག །
en: May I never criticize those with the signs of ordination, those with the signs of lay life, those who have committed downfalls, or those who have not committed downfalls.

source: བདག་རྙེད་པ་དང་། བཀུར་སྟི་དང་། ཚིགས་སུ་བཅད་པ་དག་ལ་རྟག་ཏུ་མེ་དང་། དུག་དང་། མཚོན་ཆ་ལྟ་བུར་འདུ་ཤེས་སྐྱེད་པར་གྱུར་ཅིག །
en: May I always perceive acquisitions, honors, and praise as being like fire, poison, and weapons. “ ‘

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གིས་ཇི་ལྟར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་སྨོན་ལམ་བཏབ་པའི་སྨོན་ལམ་འདི་དག་བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་པ་ཉེ་བར་བཟུང་བའི་བར་དུ་ཡང་དག་པར་འགྲུབ་པར་འགྱུར་བ་ལྟ་ན། དེའི་སླད་དུ་བདག་གི་སུག་པ་གཉིས་སུ་ལྷའི་འཁོར་ལོ་རིན་པོ་ཆེའི་རྩིབས་སྟོང་མཆིས་པ། ལྟེ་བ་དང་བཅས་པ། མུ་ཁྱུད་དང་བཅས་པ། ཉི་མའི་ཁ་དོག་ལྟར་འོད་གསལ་བ་དག་འབྱུང་བར་གྱུར་ཅིག །
en: Bhadanta Bhagavat, if these prayers of mine, made in your presence, are to be perfectly fulfilled from now until I reach enlightenment, then may there appear on both my hands precious divine wheels, each with a thousand spokes, a hub, and a rim, and each as bright as the luster of the sun.’ “

source: རྒྱལ་བུ་སྡིག་མེད་ཀྱིས་ཚིག་དེ་སྐད་སྨྲས་མ་ཐག་ཏུ་ལག་པ་གཉིས་སུ་ཇི་ལྟར་འདོད་པ་དེ་ལྟ་བུའི་འཁོར་ལོ་དག་བྱུང་བར་གྱུར་པ་དང་། ཡང་གསོལ་པ།
en: As soon as Prince Anagha said those words, there appeared upon both his hands such wheels as he had wished for.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་གི་བར་དུ་བདག་གི་རེ་བ་འདི་ལྟ་བུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལྟ་ན། དེའི་སླད་དུ་འཁོར་ལོ་འདི་དག་འདི་ལྟར་ཐམས་ཅད་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དག་སྒྲས་མངོན་པར་གོ་བར་བགྱི་བ་དང་།
en: Then he said, ‘Bhadanta Bhagavat, if my wishes are to be fulfilled from now until I reach enlightenment, then may these wheels go to the empty buddha realms that have the five degeneracies.

source: བྱང་ཆུབ་སེམས་དཔའ་ལུང་སྟོན་པ་དྲན་པ་མི་བརྗེད་པའི་ཡེ་ཤེས་མཐོང་བ་དང་། སྟོང་པ་ཉིད་བསྒོམ་པ་ལ་སྤྱོད་པ་སངས་རྒྱས་ཀྱི་ཡུལ་གྱི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སྤྱོད་དུ་སྩལ་བའི་སླད་དུ་ཇི་ལྟར་ཀླུའི་རྒྱལ་པོ་དགའ་བོ་དང་། ཉེ་དགའ་བོ་གཉིས་མཆིས་པ་དེ་ལྟ་བུའི་སྒྲ་གསང་མཐོན་པོས་སངས་རྒྱས་ཀྱི་ཞིང་སྙིགས་མ་ལྔ་དང་ལྡན་པ་སྟོང་པ་དག་དུ་མཆི་བར་གྱུར་ཅིག །
en: With a sound as loud as the movements of the nāga kings Nanda and Upananda, may they spread, throughout each entire buddha realm, the Dharma discourse on the domain of buddhas, who engage in prophecies to bodhisattvas, mindfulness, unforgetfulness, wisdom, vision, and meditation on emptiness.

source: གང་དག་དེར་སྐྱེས་པའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱིས་རྣ་བའི་དབང་པོ་དག་ཏུ་ཡང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གྲག་པར་གྱུར་ཅིག །
en: And may this Dharma discourse come to appear in the auditory faculties of all the beings born there.

source: གྲགས་མ་ཐག་ཏུ་ཡང་སེམས་ཅན་དེ་དག་གི་འདོད་ཆགས་རབ་ཏུ་ཞི་བར་གྱུར་ཅིག །ཞེ་སྡང་དང་། གཏི་མུག་དང་། ང་རྒྱལ་དང་། ཕྲག་དོག་དང་།
en: And, as soon as it is heard, may the desire of those beings cease, and may their anger, ignorance, pride, envy, and miserliness cease.

source: སེར་སྣ་རབ་ཏུ་ཞི་བར་གྱུར་ཅིག །ཐམས་ཅད་ཀྱང་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་ཡིད་ལ་བགྱིད་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པར་གྱུར་ཅིག །
en: With their minds focused on recollecting all the buddhas, may they give rise to the aspiration for the highest, most complete enlightenment.’ “

source: རིགས་ཀྱི་བུ་རྒྱལ་བུ་སྡིག་མེད་ཀྱིས་འཁོར་ལོ་རིན་པོ་ཆེ་དེ་དག་བཏང་བ་དང་།
en: Noble son, Prince Anagha sent forth those two precious wheels, moving as fast as bhagavat buddhas can.

source: དེ་དག་འདི་ལྟར་མགྱོགས་པར་སོང་སྟེ། འདི་ལྟ་སྟེ། དཔེར་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་མགྱོགས་པས་གཤེགས་པ་དེ་བཞིན་དུ་འཁོར་ལོ་རིན་པོ་ཆེ་དེ་དག་ཀྱང་སོང་སྟེ་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་སྙིགས་མ་ལྔ་དང་ལྡན་པ་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་ཏུ་སོང་ནས། སེམས་ཅན་རྣམས་བྱང་ཆུབ་སེམས་དཔའ་ལུང་སྟོན་པ་དྲན་པ་མི་བརྗེད་པའི་ཡེ་ཤེས་མཐོང་བ་སྟོང་པ་ཉིད་བསྒོམ་པ་ལ་སྤྱོད་པ་སངས་རྒྱས་ཀྱི་ཡུལ་གྱི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སྤྱོད་དུ་བཅུག་གོ།
en: In such manner those two precious wheels went to countless, limitless buddha realms in the ten directions that had the five degeneracies, and to the beings there spread the Dharma discourse on the domain of buddhas, who engage in prophecies to bodhisattvas, mindfulness, unforgetfulness, wisdom, vision, and meditation on emptiness.

source: །སེམས་ཅན་གང་དག་གི་རྣ་བའི་དབང་པོར་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གྲག་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱི་འདོད་ཆགས་དང་། སེར་སྣའི་བར་གྱི་སེམས་དང་སེམས་ལས་བྱུང་བ་དག་རབ་ཏུ་ཞི་བར་གྱུར་ཅིག །
en: And this Dharma discourse came to appear in the auditory faculties of those beings, and for all of them any mind or mental events of desire, and so on, up to and including miserliness, ceased.

source: ཐམས་ཅད་ཀྱིས་ཀྱང་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཀྱི་ཡུལ་ཡིད་ལ་བྱེད་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས་འཁོར་ལོ་དེ་དག་ཀྱང་ཡུད་ཙམ་གཅིག་གིས་ཕྱིར་ལོག་སྟེ་རྒྱལ་བུ་སྡིག་མེད་ཀྱི་མདུན་དུ་འདུག་གོ།
en: With their minds on the domain of wisdom of the buddhas, they gave rise to the aspiration for the highest, most complete enlightenment, and within an instant the wheels returned and stood in front of Prince Anagha. “

source: །རིགས་ཀྱི་བུ་དེ་ནས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་རྒྱལ་བུ་སྡིག་མེད་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ། རིགས་ཀྱི་བུ་ལེགས་སོ་ལེགས་སོ། །ཁྱོད་ཀྱིས་ནི་སྨོན་ལམ་ཤིན་ཏུ་བཟང་པོ་བཏབ་སྟེ།
en: Then, noble son, the Tathāgata Ratnagarbha said to Prince Anagha, ‘Excellent, excellent, noble son, you have made a very splendid prayer.

source: ལྷའི་འཁོར་ལོ་རིན་པོ་ཆེ་འདི་དག་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་སྙིགས་མ་ལྔ་དང་ལྡན་པ་སྟོང་པ་དག་ཏུ་བཏང་བས་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་མང་པོ་དག་རྙོག་པ་མེད་པའི་སེམས་ལ་བཀོད་ཅིང་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་པས་ན་རིགས་ཀྱི་བུ་དེའི་ཕྱིར་ཁྱོད་མི་འཁྲུགས་པ་ཞེས་བྱ་བར་གྱུར་ཅིག །
en: And you have sent these precious divine wheels to buddha realms that are empty and have the five degeneracies, and you have established many hundreds of thousands of millions of trillions of beings in unpolluted states of mind and have made them focus upon enlightenment. Therefore, noble son, you will be known as Akṣobhya.

source: མི་འཁྲུགས་པ་ཁྱོད་ནི་འཇིག་རྟེན་གྱི་ཡོངས་སུ་འདྲེན་པར་འགྱུར་གྱིས།
en: You, Akṣobhya, will become a guide for the world.
